IdeaRS.Connections
AnchoringDataHelper.ParseToAbsPos Method (IList`1<String>, Double, IFormatProvider)
Compatible with IDEA StatiCa 0.0
[Missing <summary> documentation for "M:IdeaRS.Connections.Data.AnchoringDataHelper.ParseToAbsPos(System.Collections.Generic.IList{System.String},System.Double,System.IFormatProvider)"]
 Namespace: IdeaRS.Connections.Data
 Assembly: IdeaRS.Connections (in IdeaRS.Connections.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public static IList<double> ParseToAbsPos(
	IList<string> gr,
	double scale = 1,
	IFormatProvider provider = null
)
Parameters
gr
Type: IList<String>
[Missing <param name="gr"/> documentation for "M:IdeaRS.Connections.Data.AnchoringDataHelper.ParseToAbsPos(System.Collections.Generic.IList{System.String},System.Double,System.IFormatProvider)"]
scale (Optional)
Type: Double
[Missing <param name="scale"/> documentation for "M:IdeaRS.Connections.Data.AnchoringDataHelper.ParseToAbsPos(System.Collections.Generic.IList{System.String},System.Double,System.IFormatProvider)"]
provider (Optional)
Type: IFormatProvider
[Missing <param name="provider"/> documentation for "M:IdeaRS.Connections.Data.AnchoringDataHelper.ParseToAbsPos(System.Collections.Generic.IList{System.String},System.Double,System.IFormatProvider)"]
Return Value
Type: IList<Double>
[Missing <returns> documentation for "M:IdeaRS.Connections.Data.AnchoringDataHelper.ParseToAbsPos(System.Collections.Generic.IList{System.String},System.Double,System.IFormatProvider)"]
See Also
Reference
AnchoringDataHelper Class
ParseToAbsPos Overload
IdeaRS.Connections.Data Namespace